from fastapi import FastAPI
app=FastAPI()

@app.get("/")
async def root():
    return "hello!!!!!!!"

if __name__ == "__main__":
    uvicorn.run("sample:app", host="127.0.0.1", port:8000, reload=True)
#פתחו שרת המאפשר למשתמשים לנהל משימות במערכת.
# כל משימה צריכה לכלול
# שם, תיאור, מזהה יחודי, ובנוסף סטטוס – פתוחה או סגורה.
#כדי לוודא שהמשימות שנשמרות עומדות בתקנים הנדרשים,
# השתמשו בולידציות של pydantic   .
#בתום כל בקשה, החזירו סטטוס מתאים
# והודיעו על שגיאות עם פרטים מתאימים.

